Repository: hamilcar1026/polish-learning-app
Catalog: lib/l10n/app_*.arb
Languages: ko, pl, ru, uk

# appTitle
source: Polish Learning App
ko: 폴란드어 학습 앱
pl: Aplikacja do Nauki Polskiego
ru: Приложение для изучения польского
uk: Польський додаток для навчання

# searchHint
source: Enter a Polish word
ko: 폴란드어 단어를 입력하세요
pl: Wpisz polskie słowo
ru: Введите польское слово
uk: Введіть слово для пошуку...

# settingsTitle
source: Settings
ko: 설정
pl: Ustawienia
ru: Настройки
uk: Налаштування

# languageSettingTitle
source: Language
ko: 언어
pl: Język
ru: Язык
uk: Мова

# fontSizeSettingTitle
source: Font Size
ko: 글꼴 크기
pl: Rozmiar czcionki
ru: Размер шрифта
uk: Розмір шрифту

# analysisTitle
source: Analysis
ko: 분석
pl: Analiza
ru: Анализ
uk: Аналіз

# declensionTitle
source: Declension
ko: 격변화
pl: Deklinacja
ru: Склонение
uk: Відмінювання

# conjugationTitle
source: Conjugation
ko: 활용
pl: Koniugacja
ru: Спряжение
uk: Дієвідміна

# grammarTitle
source: Grammar
ko: 문법
pl: Gramatyka
ru: Грамматика
uk: Граматика

# pronounceWordTooltip
source: Pronounce the word
ko: 단어 발음 듣기
pl: Wymów słowo
ru: Произнести слово
uk: Вимовити слово

# searchButtonTooltip
source: Search
ko: 검색
pl: Szukaj
ru: Поиск
uk: Шукати слово

# noAnalysisFound
source: No analysis found for "{word}".
ko: "{word}"에 대한 분석을 찾을 수 없습니다.
pl: Nie znaleziono analizy dla "{word}".
ru: Анализ для "{word}" не найден.
uk: Аналіз не знайдено для "{word}"

# noDeclensionData
source: No declension data found.
ko: 격변화 데이터를 찾을 수 없습니다.
pl: Nie znaleziono danych deklinacji.
ru: Данные склонения не найдены.
uk: Дані про відмінювання не знайдено.

# noConjugationData
source: No conjugation data found.
ko: 활용 데이터를 찾을 수 없습니다.
pl: Nie znaleziono danych koniugacji.
ru: Данные спряжения не найдены.
uk: Дані про дієвідміну не знайдено.

# loadingError
source: Error loading: {error}
ko: 로딩 오류: {error}
pl: Błąd ładowania: {error}
ru: Ошибка загрузки: {error}
uk: Помилка завантаження: {error}

# tag_subst
source: noun
ko: 명사
pl: rzeczownik
ru: существительное
uk: іменник

# tag_fin
source: verb (fin)
ko: 동사 (정형)
pl: czasownik (os.)
ru: глагол (fin)
uk: дієслово (фінітне)

# tag_adj
source: adjective
ko: 형용사
pl: przymiotnik
ru: прилагательное
uk: прикметник

# tag_adv
source: adverb
ko: 부사
pl: przysłówek
ru: наречие
uk: прислівник

# tag_num
source: numeral
ko: 수사
pl: liczebnik
ru: числительное
uk: числівник

# tag_ppron12
source: pronoun (1st/2nd)
ko: 대명사 (1/2인칭)
pl: zaimek (1/2 os.)
ru: местоимение (1/2 л.)
uk: займенник (1/2 ос.)

# tag_ppron3
source: pronoun (3rd)
ko: 대명사 (3인칭)
pl: zaimek (3 os.)
ru: местоимение (3 л.)
uk: займенник (3 ос.)

# tag_siebie
source: pronoun (refl)
ko: 대명사 (재귀)
pl: zaimek (zwrot.)
ru: местоимение (возвр.)
uk: займенник (зворотний)

# tag_inf
source: infinitive
ko: 부정사
pl: bezokolicznik
ru: инфинитив
uk: інфінітив

# tag_praet
source: verb (past)
ko: 동사 (과거)
pl: czasownik (przesz.)
ru: глагол (прош.)
uk: дієслово (мин. час)

# tag_impt
source: imperative
ko: 명령법
pl: tryb rozkazujący
ru: повелительное накл.
uk: наказовий спосіб

# tag_pred
source: predicative
ko: 술어사
pl: predykatyw
ru: предикатив
uk: предикатив

# tag_prep
source: preposition
ko: 전치사
pl: przyimek
ru: предлог
uk: прийменник

# tag_conj
source: conjunction
ko: 접속사
pl: spójnik
ru: союз
uk: сполучник

# tag_comp
source: comparative marker
ko: 비교 표지
pl: wskaźnik stopnia
ru: маркер сравн. степени
uk: компаративний маркер

# tag_interj
source: interjection
ko: 감탄사
pl: wykrzyknik
ru: междометие
uk: вигук

# tag_pact
source: participle (act)
ko: 분사 (능동)
pl: imiesłów (czynn.)
ru: причастие (действ.)
uk: дієприкметник (активний)

# tag_ppas
source: participle (pass)
ko: 분사 (수동)
pl: imiesłów (biern.)
ru: причастие (страд.)
uk: дієприкметник (пасивний)

# tag_pcon
source: participle (pres adv)
ko: 분사 (현재 부사)
pl: imiesłów (współ.)
ru: деепричастие (наст.)
uk: дієприслівник (тепер. час)

# tag_pant
source: participle (ant adv)
ko: 분사 (선행 부사)
pl: imiesłów (uprz.)
ru: деепричастие (прош.)
uk: дієприслівник (мин. час)

# tag_ger
source: gerund
ko: 동명사
pl: rzeczownik odsł.
ru: герундий
uk: герундій

# tag_bedzie
source: verb (fut aux)
ko: 동사 (미래 조동사)
pl: czasownik (przysz. aux)
ru: глагол (буд. всп.)
uk: дієслово (майб. час, доп.)

# tag_aglt
source: agglutinant
ko: 교착소
pl: aglutynant
ru: агглютинант
uk: аглютинант

# tag_qub
source: quasilexical unit
ko: 준어휘 단위
pl: quasi-leksem
ru: квазилексическая ед.
uk: квазілексемна одиниця

# tag_depr
source: depreciative noun
ko: 경멸 명사
pl: rzeczownik depr.
ru: уничижительное сущ.
uk: іменник (зневажливий)

# tag_adja
source: adj participle (act)
ko: 형용사적 분사 (능동)
pl: przym. czynny
ru: прил. причастие (действ.)
uk: прикметник (дієприкм. акт.)

# tag_adjp
source: adj participle (pass)
ko: 형용사적 분사 (수동)
pl: przym. bierny
ru: прил. причастие (страд.)
uk: прикметник (дієприкм. пас.)

# tag_cond
source: conditional
ko: 조건법
pl: tryb warunkowy
ru: условное наклонение
uk: умовний спосіб

# qualifier_sg
source: sg
ko: 단수
pl: lp
ru: ед.
uk: одн.

# qualifier_pl
source: pl
ko: 복수
pl: lm
ru: мн.
uk: мн.

# qualifier_nom
source: nom
ko: 주격
pl: mian.
ru: им.
uk: наз.

# qualifier_gen
source: gen
ko: 생격
pl: dop.
ru: род.
uk: род.

# qualifier_dat
source: dat
ko: 여격
pl: cel.
ru: дат.
uk: дав.

# qualifier_acc
source: acc
ko: 대격
pl: bier.
ru: вин.
uk: знах.

# qualifier_inst
source: inst
ko: 조격
pl: narz.
ru: тв.
uk: оруд.

# qualifier_loc
source: loc
ko: 처격
pl: miejsc.
ru: пр.
uk: місц.

# qualifier_voc
source: voc
ko: 호격
pl: woł.
ru: зв.
uk: клич.

# qualifier_m1
source: m1
ko: 남성 인물
ru: м1
uk: ч1

# qualifier_m2
source: m2
ko: 남성 동물
ru: м2
uk: ч2

# qualifier_m3
source: m3
ko: 남성 사물
ru: м3
uk: ч3

# qualifier_f
source: f
ko: 여성
pl: ż
ru: ж
uk: ж

# qualifier_n
source: n
ko: 중성
ru: с
uk: с

# qualifier_n1
source: n1
ko: 중성1
ru: с1
uk: с1

# qualifier_n2
source: n2
ko: 중성2
ru: с2
uk: с2

# qualifier_p1
source: p1
ko: 복수 남성 인물
ru: л1
uk: 1ос

# qualifier_p2
source: p2
ko: 복수 남성 비인물
ru: л2
uk: 2ос

# qualifier_p3
source: p3
ko: 복수 비남성
ru: л3
uk: 3ос

# qualifier_pri
source: 1st
ko: 1인칭
ru: 1л
uk: 1-й

# qualifier_sec
source: 2nd
ko: 2인칭
ru: 2л
uk: 2-й

# qualifier_ter
source: 3rd
ko: 3인칭
ru: 3л
uk: 3-й

# qualifier_imperf
source: imperf
ko: 미완료
pl: ndk.
ru: несов.
uk: недок.

# qualifier_perf
source: perf
ko: 완료
pl: dk.
ru: сов.
uk: док.

# qualifier_nazwa_pospolita
source: common
ko: 보통명사
pl: posp.
ru: нариц.
uk: загальна назва

# qualifier_imie
source: name
ko: 이름
pl: imię
ru: имя
uk: ім'я

# qualifier_nazwisko
source: surname
ko: 성
pl: nazwisko
ru: фамилия
uk: прізвище

# qualifier_nazwa_geograficzna
source: geo.
ko: 지명
pl: geogr.
ru: геогр.
uk: геогр.

# qualifier_skrot
source: abbr.
ko: 약어
pl: skrót
ru: сокр.
uk: скор.

# qualifier_pos
source: pos
ko: 원급
pl: st. równy
ru: положит.
uk: ствердж.

# qualifier_com
source: com
ko: 비교급
pl: st. wyższy
ru: сравн.
uk: порівн.

# qualifier_sup
source: superlative
ko: 최상급
pl: stopień najwyższy
ru: превосходная степень
uk: найвищ.

# qualifier_congr
source: congruence
ko: 일치
pl: kongruencja
ru: согласование
uk: узгодження

# qualifier_ncol
source: non-collective
ko: 비집합
pl: niezbiorowy
ru: несобирательное
uk: незбірний

# qualifier_rec
source: governing
ko: 격 지배
pl: rządzący
ru: управляющий
uk: керуючий

# conjugationCategoryPresentIndicative
source: Present Indicative
ko: 현재 시제 (직설법)
pl: Czas teraźniejszy
ru: Настоящее время (изъяв.)
uk: Теперішній час, дійсний спосіб

# conjugationCategoryFuturePerfectiveIndicative
source: Future Perfective Indicative
ko: 미래 완료 시제 (직설법)
pl: Czas przyszły dokonany
ru: Будущее время (соверш., изъяв.)
uk: Майбутній доконаний час, дійсний спосіб

# conjugationCategoryFutureImperfectiveIndicative
source: Future Imperfective Indicative
ko: 미래 미완료 시제 (직설법)
pl: Czas przyszły niedokonany
ru: Будущее время (несоверш., изъяв.)
uk: Майбутній недоконаний час, дійсний спосіб

# conjugationCategoryPastTense
source: Past Tense
ko: 과거 시제
pl: Czas przeszły
ru: Прошедшее время
uk: Минулий час

# conjugationCategoryImperative
source: Imperative
ko: 명령법
pl: Tryb rozkazujący
ru: Повелительное наклонение
uk: Наказовий спосіб

# conjugationCategoryInfinitive
source: Infinitive
ko: 부정사
pl: Bezokolicznik
ru: Инфинитив
uk: Інфінітив

# conjugationCategoryPresentAdverbialParticiple
source: Present Adverbial Participle
ko: 현재 부사 분사
pl: Imiesłów przysłówkowy współczesny
ru: Деепричастие настоящего времени
uk: Дієприслівник теперішнього часу

# conjugationCategoryAnteriorAdverbialParticiple
source: Anterior Adverbial Participle
ko: 선행 부사 분사
pl: Imiesłów przysłówkowy uprzedni
ru: Деепричастие прошедшего времени
uk: Дієприслівник минулого часу (попередній)

# conjugationCategoryPresentActiveParticiple
source: Present Active Participle
ko: 현재 능동 분사
pl: Imiesłów przymiotnikowy czynny
ru: Действительное причастие настоящего времени
uk: Активний дієприкметник теперішнього часу

# conjugationCategoryPastPassiveParticiple
source: Past Passive Participle
ko: 과거 수동 분사
pl: Imiesłów przymiotnikowy bierny
ru: Страдательное причастие прошедшего времени
uk: Пасивний дієприкметник минулого часу

# conjugationCategoryFiniteVerb
source: Finite Verb
ko: 정형 동사
pl: Forma osobowa
ru: Личный глагол
uk: Фінітне дієслово

# conjugationCategoryOtherForms
source: Other Forms
ko: 기타 형태
pl: Inne formy
ru: Другие формы
uk: Інші форми

# conjugationCategoryImpersonal
source: Impersonal
ko: 비인칭
uk: Безособові форми

# conjugationCategoryVerbalNoun
source: Verbal Noun
ko: 동명사
uk: Віддієслівний іменник

# conjugationCategoryConditional
source: Conditional
ko: 조건법
uk: Умовний спосіб

# conjugationCategoryPresentImpersonal
source: Present Impersonal
ko: 현재 비인칭
pl: Bezosobowa teraźniejsza
ru: Настоящее безличное
uk: Безособова форма теперішнього часу

# conjugationCategoryPastImpersonal
source: Past Impersonal
ko: 과거 비인칭
pl: Bezosobowa przeszła
ru: Прошедшее безличное
uk: Безособова форма минулого часу

# conjugationCategoryFutureImpersonal
source: Future Impersonal
ko: 미래 비인칭
pl: Bezosobowa przyszła
ru: Будущее безличное
uk: Безособова форма майбутнього часу

# conjugationCategoryConditionalImpersonal
source: Conditional Impersonal
ko: 조건법 비인칭
pl: Bezosobowa trybu warunkowego
ru: Условное безличное
uk: Безособова форма умовного способу

# conjugationCategoryImperativeImpersonal
source: Impersonal Imperative
ko: 명령형 비인칭
pl: Tryb rozkazujący nieosobowy
ru: Повелительное безличное наклонение
uk: Безособовий наказовий спосіб

# drawerRecentSearches
source: Recent Searches
ko: 최근 검색어
pl: Ostatnie wyszukiwania
ru: Недавние поиски
uk: Останні пошуки

# drawerClearRecentSearchesTooltip
source: Clear Recent Searches
ko: 최근 검색어 지우기
pl: Wyczyść ostatnie wyszukiwania
ru: Очистить недавние поиски
uk: Очистити останні пошуки

# drawerClearRecentSearchesDialogTitle
source: Clear Recent Searches?
ko: 최근 검색어를 지우시겠습니까?
pl: Wyczyścić ostatnie wyszukiwania?
ru: Очистить недавние поиски?
uk: Очистити останні пошуки?

# drawerClearDialogContent
source: This action cannot be undone.
ko: 이 작업은 되돌릴 수 없습니다.
pl: Tej operacji nie można cofnąć.
ru: Это действие нельзя отменить.
uk: Цю дію неможливо скасувати.

# drawerCancelButton
source: Cancel
ko: 취소
pl: Anuluj
ru: Отмена
uk: Скасувати

# drawerClearButton
source: Clear
ko: 지우기
pl: Wyczyść
ru: Очистить
uk: Очистити все

# drawerNoRecentSearches
source: No recent searches.
ko: 최근 검색어가 없습니다.
pl: Brak ostatnich wyszukiwań.
ru: Нет недавних поисков.
uk: Немає останніх пошуків.

# drawerFavorites
source: Favorites
ko: 즐겨찾기
pl: Ulubione
ru: Избранное
uk: Обране

# drawerNoFavorites
source: No favorites added yet.
ko: 즐겨찾기에 추가된 단어가 없습니다.
pl: Nie dodano jeszcze ulubionych.
ru: Нет избранных слов.
uk: Ще не додано до обраного.

# settingsThemeSystem
source: System Default
ko: 시스템 기본값
pl: Domyślny systemowy
ru: Системная
uk: Системна тема за замовчуванням

# tableHeaderCase
source: Case
ko: 격
pl: Przypadek
ru: Падеж
uk: Відмінок

# tableHeaderSingular
source: Singular
ko: 단수
pl: Liczba pojedyncza
ru: Ед. ч.
uk: Однина

# tableHeaderPlural
source: Plural
ko: 복수
pl: Liczba mnoga
ru: Мн. ч.
uk: Множина

# tableHeaderM1
source: Masc. Pers.
ko: 남성 인격
pl: Męskoos.
ru: Муж. лиц.
uk: Чол. ос.

# tableHeaderMOther
source: Masc. Other
ko: 남성 비인격
pl: Inne męskie
ru: Муж. др.
uk: Чол. ін.

# tableHeaderF
source: Feminine
ko: 여성
pl: Żeński
ru: Женский
uk: Жін. ос.

# tableHeaderN
source: Neuter
ko: 중성
pl: Nijaki
ru: Средний
uk: Сер. ос.

# tableHeaderPerson
source: Person
ko: 인칭
pl: Osoba
ru: Лицо
uk: Особа

# caseNominative
source: Nominative
ko: 주격
pl: Mianownik
ru: Именительный падеж
uk: Називний

# caseGenitive
source: Genitive
ko: 생격
pl: Dopełniacz
ru: Родительный
uk: Родовий

# caseDative
source: Dative
ko: 여격
pl: Celownik
ru: Дательный
uk: Давальний

# caseAccusative
source: Accusative
ko: 대격
pl: Biernik
ru: Винительный
uk: Знахідний

# caseInstrumental
source: Instrumental
ko: 조격
pl: Narzędnik
ru: Творительный
uk: Орудний

# caseLocative
source: Locative
ko: 처격
pl: Miejscownik
ru: Предложный
uk: Місцевий

# caseVocative
source: Vocative
ko: 호격
pl: Wołacz
ru: Звательный
uk: Кличний

# settingsContributors
source: Contributors
ko: 기여자
pl: Współtwórcy
ru: Участники
uk: Автори

# personLabelFirst
source: 1st (I/we)
ko: 1인칭 (나/우리)
pl: 1. os. (ja/my)
ru: 1-е\n(я/мы)
uk: 1-а ос. (я/ми)

# personLabelSecond
source: 2nd (you/you)
ko: 2인칭 (너/너희)
pl: 2. os. (ty/wy)
ru: 2-е\n(ты/вы)
uk: 2-а ос. (ти/ви)

# personLabelThird
source: 3rd (he/she/it/they)
ko: 3인칭 (그/그녀/그것/그들)
pl: 3. os. (on/ona/ono/oni/one)
ru: 3-е\n(он/она/оно/они)
uk: 3-я ос. (він/вона/воно/вони)

# genderLabelM1
source: Masc. Personal
ko: 남성 인물
pl: Męskoosobowy
ru: Мужской личный
uk: Чоловічий особовий

# genderLabelM2
source: Masc. Animate
ko: 남성 동물
pl: Męskożywotny
ru: Мужской одушевленный
uk: Чоловічий живий

# genderLabelM3
source: Masc. Inanimate
ko: 남성 사물
pl: Męskorzeczowy
ru: Мужской неодушевленный
uk: Чоловічий неживий

# genderLabelF
source: Feminine
ko: 여성
pl: Żeński
ru: женский
uk: Жіночий

# genderLabelN1
source: Neuter 1
ko: 중성 1
pl: Nijaki 1
ru: Средний 1
uk: Середній 1

# genderLabelN2
source: Neuter 2
ko: 중성 2
pl: Nijaki 2
ru: Средний 2
uk: Середній 2

# declensionTableTitle
source: Declension for "{lemma}"
ko: "{lemma}" 격변화
pl: Deklinacja dla "{lemma}"
ru: Склонение для "{lemma}"
uk: Відмінювання для "{lemma}"

# conjugationTableTitle
source: Conjugation for "{lemma}"
ko: "{lemma}" 활용
pl: Koniugacja dla "{lemma}"
ru: Спряжение для "{lemma}"
uk: Дієвідміна для "{lemma}"

# translationLabel
source: Translation
ko: 번역
pl: Tłumaczenie
ru: Перевод
uk: Переклад

# suggestionDidYouMean
source: Did you mean "{suggestedWord}"?
ko: 혹시 "{suggestedWord}"(을)를 찾으셨나요?
uk: Можливо, ви мали на увазі '{word}'?

# suggestionErrorFallback
source: Suggestion could not be loaded.
ko: 추천 단어를 불러올 수 없습니다.
pl: Nie można załadować sugestii.
ru: Не удалось загрузить предложенное слово.
uk: Не вдалося завантажити пропозицію.

# noRelevantAnalysisForNumeral
source: No relevant analysis for numeral found.
ko: 숫자에 대한 관련 분석을 찾을 수 없습니다.
pl: Nie znaleziono odpowiedniej analizy dla liczebnika.
ru: Не найдено подходящего анализа для числительного.
uk: Не знайдено відповідного аналізу для числівника.

source: Remove from favorites
ko: 즐겨찾기에서 삭제
pl: Usuń z ulubionych
ru: Удалить из избранного
uk: Видалити з обраного

source: Add to favorites
ko: 즐겨찾기에 추가
pl: Dodaj do ulubionych
ru: Добавить в избранное
uk: Додати до обраного

# impersonalAccuracyWarning
source: Impersonal forms may be less accurate
ko: 비인칭 형태는 정확하지 않을 수 있습니다
pl: Formy bezosobowe mogą być mniej dokładne
ru: Безличные формы могут быть менее точными
uk: Безособові форми можуть бути менш точними

# impersonalPresentForm
source: Impersonal present form (imperf)
ko: 비인칭 현재형 (미완료)
uk: Безособова форма теперішнього часу

# impersonalPastForm
source: Impersonal past form (perf)
ko: 비인칭 과거형 (완료)
uk: Безособова форма минулого часу

source: Impersonal future form
ko: 비인칭 미래형
uk: Безособова форма майбутнього часу

source: Impersonal conditional form
ko: 비인칭 조건법
uk: Безособова умовна форма

# settingsLanguage
source: Language
ko: 언어
pl: Język
ru: Язык
uk: Мова

# genderLabelM
source: masculine
ko: 남성
pl: męski
ru: мужской
uk: чоловічий

# genderLabelN
source: neuter
ko: 중성
pl: nijaki
ru: средний
uk: середній

# genderLabelM1Pl
source: masc. pers.
ko: 남성 인격
pl: męskoosob.
ru: муж. лиц.
uk: чол. ос. (мн.)

# genderLabelNonM1Pl
source: non-masc. pers.
ko: 비남성 인격
pl: niemęskoosob.
ru: не-муж. лиц.
uk: не чол. ос. (мн.)
